import * as yup from "yup";

export const loginValidationSchema = yup.object({
  email: yup
    .string("ایمیل خود را وارد کنید.")
    .email("لطفا ایمیل معتبر وارد کنید.")
    .required("وارد کردن ایمیل اجباری است."),
  password: yup
    .string("رمز عبور خود را وارد کنید.")
    .min(8, "رمز عبور باید حداقل ۸ کاراکتر باشد.")
    .matches(/[A-Z]/, "رمز عبور باید حداقل یک حرف بزرگ داشته باشد.")
    .matches(
      /[!@#$%^&*(),.?":{}|<>]/,
      "رمز عبور باید حداقل یک نماد داشته باشد."
    )
    .required("وارد کردن رمز عبور اجباری است."),
});
export const signUpValidationSchema = yup.object({
  email: yup
    .string("ایمیل خود را وارد کنید.")
    .email("لطفا ایمیل معتبر وارد کنید.")
    .required("وارد کردن ایمیل اجباری است."),
  password: yup
    .string("رمز عبور خود را وارد کنید.")
    .min(8, "رمز عبور باید حداقل ۸ کاراکتر باشد.")
    .matches(/[A-Z]/, "رمز عبور باید حداقل یک حرف بزرگ داشته باشد.")
    .matches(
      /[!@#$%^&*(),.?":{}|<>]/,
      "رمز عبور باید حداقل یک نماد داشته باشد."
    )
    .required("وارد کردن رمز عبور اجباری است."),
  firstName: yup
    .string("نام خود را  وارد  کنید ")
    .required("وارد کردن  نام  اجباری  است"),
  lastName: yup
    .string("نام خانوادگی  خود را  وارد کنید")
    .required("وارد کردن نام  خانوادگی  اجباری  است ."),
});
